/**
 * @file
 * @brief Заголовочный файл для вспомогательных функций и алгоритмов
 * 
 * Данный файл содержит в себе функции минимума/максимума
 * @author Бутаку Роман
 * @version 1.0
 * @date Последнее изменение: 10 июля 2024 года
*/


#ifndef TOOLS_H__
#define TOOLS_H__

/**
 * @brief Функция для поиска минимума среди двух чисел
 * @param[in] a Первое число
 * @param[in] b Второе число
 * @return Наименьшее среди a и b число
*/
int min(int a, int b);

/**
 * @brief Функция для поиска максимума среди двух чисел
 * @param[in] a Первое число
 * @param[in] b Второе число
 * @return Наибольшее среди a и b число
*/
int max(int a, int b);

#endif // TOOLS_H__

